In [30]:
import pandas as pd
import numpy as np

# Sample DataFrame
data = {
    'Name': ['jaanu', 'lavanya', 'brayer', 'lakshith', 'bakey'],
    'Age': [22, 20, 25, 19, 29],
    'Salary': [50000, 60000, 70000, 80000, 55000],
    'Department': ['HR', 'IT', 'Finance', 'IT', 'HR']
}

df = pd.DataFrame(data)
df

       Name  Age  Salary Department
0     jaanu   22   50000         HR
1   lavanya   20   60000         IT
2    brayer   25   70000    Finance
3  lakshith   19   80000         IT
4     bakey   29   55000         HR

In [31]:
df['Salary']

0    50000
1    60000
2    70000
3    80000
4    55000
Name: Salary, dtype: int64

In [32]:
(lambda x : x*0.50)(x=50000)

25000.0

In [33]:
bonus = (lambda x : x*0.30)
print(bonus(x=50000))
bonus(100000)

15000.0

30000.0

In [34]:
df['Salary'].apply(lambda salary: salary*(30/100))

0    15000.0
1    18000.0
2    21000.0
3    24000.0
4    16500.0
Name: Salary, dtype: float64

In [35]:
df['Bonus'] = df['Salary'].apply(lambda salary: salary*(30/100))
df

       Name  Age  Salary Department    Bonus
0     jaanu   22   50000         HR  15000.0
1   lavanya   20   60000         IT  18000.0
2    brayer   25   70000    Finance  21000.0
3  lakshith   19   80000         IT  24000.0
4     bakey   29   55000         HR  16500.0

In [36]:
df['Salary']

0    50000
1    60000
2    70000
3    80000
4    55000
Name: Salary, dtype: int64

In [37]:
df["Bonus"]=[round(sal*0.30) for sal in df['Salary']]

In [38]:
df

       Name  Age  Salary Department  Bonus
0     jaanu   22   50000         HR  15000
1   lavanya   20   60000         IT  18000
2    brayer   25   70000    Finance  21000
3  lakshith   19   80000         IT  24000
4     bakey   29   55000         HR  16500

In [39]:
df["Name"].apply(str.upper)

0       JAANU
1     LAVANYA
2      BRAYER
3    LAKSHITH
4       BAKEY
Name: Name, dtype: object

In [40]:
df["Name"] = df["Name"].apply(str.upper)

In [41]:
df

       Name  Age  Salary Department  Bonus
0     JAANU   22   50000         HR  15000
1   LAVANYA   20   60000         IT  18000
2    BRAYER   25   70000    Finance  21000
3  LAKSHITH   19   80000         IT  24000
4     BAKEY   29   55000         HR  16500

In [42]:
df["Names Length"] = df["Name"].apply(len)

In [43]:
df

       Name  Age  Salary Department  Bonus  Names Length
0     JAANU   22   50000         HR  15000             5
1   LAVANYA   20   60000         IT  18000             7
2    BRAYER   25   70000    Finance  21000             6
3  LAKSHITH   19   80000         IT  24000             8
4     BAKEY   29   55000         HR  16500             5

In [44]:
df[["Name","Department"]] = df[["Name","Department"]].applymap(str.lower)
df

C:\Users\Sanjay\AppData\Local\Temp\ipykernel_17104\2750781626.py:1: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  df[["Name","Department"]] = df[["Name","Department"]].applymap(str.lower)

       Name  Age  Salary Department  Bonus  Names Length
0     jaanu   22   50000         hr  15000             5
1   lavanya   20   60000         it  18000             7
2    brayer   25   70000    finance  21000             6
3  lakshith   19   80000         it  24000             8
4     bakey   29   55000         hr  16500             5

In [45]:
columns_list = df.columns.tolist()
columns_list

['Name', 'Age', 'Salary', 'Department', 'Bonus', 'Names Length']

In [46]:
new_columns = [col.lower() for col in columns_list]
new_columns

['name', 'age', 'salary', 'department', 'bonus', 'names length']

In [47]:
df.columns = new_columns
df

       name  age  salary department  bonus  names length
0     jaanu   22   50000         hr  15000             5
1   lavanya   20   60000         it  18000             7
2    brayer   25   70000    finance  21000             6
3  lakshith   19   80000         it  24000             8
4     bakey   29   55000         hr  16500             5

In [48]:
filt = df['department'] == 'it'
df.loc[filt,"department"] = "info tech"
df

       name  age  salary department  bonus  names length
0     jaanu   22   50000         hr  15000             5
1   lavanya   20   60000  info tech  18000             7
2    brayer   25   70000    finance  21000             6
3  lakshith   19   80000  info tech  24000             8
4     bakey   29   55000         hr  16500             5

In [49]:
df['department']

0           hr
1    info tech
2      finance
3    info tech
4           hr
Name: department, dtype: object

In [50]:
df['department'].replace({"info tech":"it", "finance":"sales"},inplace=True)
df

       name  age  salary department  bonus  names length
0     jaanu   22   50000         hr  15000             5
1   lavanya   20   60000         it  18000             7
2    brayer   25   70000      sales  21000             6
3  lakshith   19   80000         it  24000             8
4     bakey   29   55000         hr  16500             5